In [6]:
## pandas 
## file load

import pandas as pd
csv_test = pd.read_csv('D:/py/test_csv_file.csv')

csv_test

   ID LAST_NAME  AGE
0   1       KIM   30
1   2      CHOI   25
2   3       LEE   41
3   4      PARK   19
4   5       LIM   36
5   6       KIM   32
6   7      CHOI   27
7   8       LEE   43
8   9      PARK   21
9  10       LIM   38

In [7]:
csv_test.shape

(10, 3)

In [8]:
csv_test

   ID LAST_NAME  AGE
0   1       KIM   30
1   2      CHOI   25
2   3       LEE   41
3   4      PARK   19
4   5       LIM   36
5   6       KIM   32
6   7      CHOI   27
7   8       LEE   43
8   9      PARK   21
9  10       LIM   38

In [13]:
## txt load
text_test2 = pd.read_csv('D:/py/test_text_file.txt', sep='|')
text_test2

   ID  A  B  C  D
0  C1  1  2  3  4
1  C2  5  6  7  8
2  C3  1  3  5  7

In [17]:
## id 지정해서 fiel load
csv_test2 = pd.read_csv('D:/py/test_csv_file.csv', index_col = 0)
csv_test2

   LAST_NAME  AGE
ID
1        KIM   30
2       CHOI   25
3        LEE   41
4       PARK   19
5        LIM   36
6        KIM   32
7       CHOI   27
8        LEE   43
9       PARK   21
10       LIM   38

In [21]:
# 변수 이름(column name, header) 이 없는 파일 불러올 때 이름 부여하기
text_test3 = pd.read_csv('D:/py/text_without_column_name.txt', sep='|', names=['ID', 'A', 'B', 'C', 'D'], header=None, index_col='ID')
text_test3

    A  B  C  D
ID
C1  1  2  3  4
C2  5  6  7  8
C3  1  3  5  7

In [30]:
# 6. 특정 줄은 제외하고 불러오기: skiprows = [x, x]

# skip 1st and 2nd rows (do not read 1, 2 rows)
csv_2 = pd.read_csv("D:/py/test_csv_file.csv", 
                           skiprows = [1, 1])
csv_2

   ID LAST_NAME  AGE
0   2      CHOI   25
1   3       LEE   41
2   4      PARK   19
3   5       LIM   36
4   6       KIM   32
5   7      CHOI   27
6   8       LEE   43
7   9      PARK   21
8  10       LIM   38

In [31]:
# skip 1st and 2nd rows (do not read 1, 2 rows)
csv_3 = pd.read_csv("D:/py/test_csv_file.csv", 
                           skiprows = [6, 7], index_col='ID')
csv_3

   LAST_NAME  AGE
ID
1        KIM   30
2       CHOI   25
3        LEE   41
4       PARK   19
5        LIM   36
8        LEE   43
9       PARK   21
10       LIM   38

In [40]:
# 7. n 개의 행만 불러오기: nrows = n
# read top 3 rows only

csv_4 = pd.read_csv("D:/py/test_csv_file.csv", 
                    nrows = 3, index_col = 'ID')
print(csv_4)

# csv_5 = pd.read_csv("D:/py/test_csv_file.csv", 
#                     nrows = 3, index_col = 'ID')
# print(csv_5)

   LAST_NAME  AGE
ID
1        KIM   30
2       CHOI   25
3        LEE   41
   LAST_NAME  AGE
ID
1        KIM   30
2       CHOI   25
3        LEE   41

In [1]:
## pandas
# pd.DaraFrame 만들고 Attributes 조회하기
import numpy as np
import pandas as pd
from pandas import DataFrame as df

In [4]:
df_1 = df(data=np.arange(12).reshape(3, 4),
          index=['r0', 'r1', 'r2'], # Will default to np.arange(n) if no indexing
          columns=['c0', 'c1', 'c2', 'c3'],
          dtype='int', # Data type to force, otherwise infer
          copy=False) # Copy data from inputs
df_1

    c0  c1  c2  c3
r0   0   1   2   3
r1   4   5   6   7
r2   8   9  10  11

In [5]:
# T : 행과 열 전치
df_1.T

    r0  r1  r2
c0   0   4   8
c1   1   5   9
c2   2   6  10
c3   3   7  11

In [8]:
# axes : 행과 열 이름을 리스트로 반환
print(df_1.axes)
print(df_1.axes[0])
print(df_1.axes[1])

[Index(['r0', 'r1', 'r2'], dtype='object'), Index(['c0', 'c1', 'c2', 'c3'], dtype='object')]
Index(['r0', 'r1', 'r2'], dtype='object')
Index(['c0', 'c1', 'c2', 'c3'], dtype='object')

In [9]:
# dtypes : 데이터 형태 반환
df_1.dtypes

c0    int32
c1    int32
c2    int32
c3    int32
dtype: object

In [10]:
# shpae : 행과 열의 개수(차원)을 튜플로 반환
df_1.shape

(3, 4)

In [11]:
# size : NDFrame의 원소의 개수를 반환
df_1.size

12

In [12]:
# values : NDFrame의 원소를 numpy 형태로 반환
df_1.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [13]:
# [Python pandas] DataFrame의 행 또는 열 데이터 선택해서 가져오기 (DataFrame objects indexing and selection)
import numpy as np
import pandas as pd
from pandas import DataFrame

In [14]:
##-- Making DataFrame
df_2 = DataFrame({'class_1': ['a', 'a', 'b', 'b', 'c'],
                  'var_1': np.arange(5),
                  'var_2': np.random.randn(5)},
                 index = ['r0', 'r1', 'r2', 'r3', 'r4'])

df_2

   class_1  var_1     var_2
r0       a      0  1.516500
r1       a      1 -2.016965
r2       b      2  0.338576
r3       b      3 -0.434987
r4       c      4 -1.779965

In [25]:
# (1) 행 기준으로 선택해서 가져오기 (indexing and selection by row)
print(df_2.index)
print(df_2.iloc[2:])
print(df_2.iloc[2])

Index(['r0', 'r1', 'r2', 'r3', 'r4'], dtype='object')
   class_1  var_1     var_2
r2       b      2  0.338576
r3       b      3 -0.434987
r4       c      4 -1.779965
class_1           b
var_1             2
var_2      0.338576
Name: r2, dtype: object

In [28]:
print(df_2.head(2))
print(df_2.tail(2))

   class_1  var_1     var_2
r0       a      0  1.516500
r1       a      1 -2.016965
   class_1  var_1     var_2
r3       b      3 -0.434987
r4       c      4 -1.779965

In [29]:
# (2) 열 기준으로 선택해서 가져오기 (indexing and selection by column)
df_2.columns

Index(['class_1', 'var_1', 'var_2'], dtype='object')

In [30]:
df_2['class_1']

r0    a
r1    a
r2    b
r3    b
r4    c
Name: class_1, dtype: object

In [33]:
df_2[['class_1', 'var_1']]

   class_1  var_1
r0       a      0
r1       a      1
r2       b      2
r3       b      3
r4       c      4

In [35]:
# [Python pandas] DataFrame의 index 재설정(reindex) 와 결측값 채우기(fill in missing values)
idx = ['r0', 'r1', 'r2', 'r3', 'r4']
df_1 = pd.DataFrame({

 'c1': np.arange(5),

 'c2': np.random.randn(5)},

 index=idx)

In [36]:
print(idx)
print(df_1)

['r0', 'r1', 'r2', 'r3', 'r4']
    c1        c2
r0   0  0.634878
r1   1  1.012309
r2   2 -0.451969
r3   3 -1.143373
r4   4  1.723161

In [39]:
nidx = ['r0', 'r1', 'r2', 'r5', 'r6']

In [40]:
df_1.reindex(nidx)

     c1        c2
r0  0.0  0.634878
r1  1.0  1.012309
r2  2.0 -0.451969
r5  NaN       NaN
r6  NaN       NaN

In [44]:
df_1.reindex(nidx, fill_value = 1)

    c1        c2
r0   0  0.634878
r1   1  1.012309
r2   2 -0.451969
r5   1  1.000000
r6   1  1.000000

In [45]:
df_1.reindex(nidx, fill_value='missing')

         c1        c2
r0        0  0.634878
r1        1   1.01231
r2        2 -0.451969
r5  missing   missing
r6  missing   missing

In [46]:
df_1.reindex(nidx, fill_value='NA')

    c1        c2
r0   0  0.634878
r1   1   1.01231
r2   2 -0.451969
r5  NA        NA
r6  NA        NA

In [48]:
date_idx = pd.date_range('11/27/2016', periods=5, freq='D')
date_idx

DatetimeIndex(['2016-11-27', '2016-11-28', '2016-11-29', '2016-11-30',
               '2016-12-01'],
              dtype='datetime64[ns]', freq='D')

In [49]:
df_2 = pd.DataFrame({"c1": [10, 20, 30, 40, 50]}, index=date_idx)
df_2

            c1
2016-11-27  10
2016-11-28  20
2016-11-29  30
2016-11-30  40
2016-12-01  50

In [50]:
date_idx_2 = pd.date_range('11/25/2016', periods=10, freq='D')
df_2.reindex(date_idx_2)

              c1
2016-11-25   NaN
2016-11-26   NaN
2016-11-27  10.0
2016-11-28  20.0
2016-11-29  30.0
2016-11-30  40.0
2016-12-01  50.0
2016-12-02   NaN
2016-12-03   NaN
2016-12-04   NaN

In [51]:
# (2-2) 시계열 데이터 reindex 과정에서 생긴 결측값 채우기 : method='ffill', 'bfill'
#          (fill in missing value of TimeSeries Data)
df_2.reindex(date_idx_2, method='ffill') # forward-propagation

              c1
2016-11-25   NaN
2016-11-26   NaN
2016-11-27  10.0
2016-11-28  20.0
2016-11-29  30.0
2016-11-30  40.0
2016-12-01  50.0
2016-12-02  50.0
2016-12-03  50.0
2016-12-04  50.0

In [52]:
df_2.reindex(date_idx_2, method='bfill') # forward-propagation

              c1
2016-11-25  10.0
2016-11-26  10.0
2016-11-27  10.0
2016-11-28  20.0
2016-11-29  30.0
2016-11-30  40.0
2016-12-01  50.0
2016-12-02   NaN
2016-12-03   NaN
2016-12-04   NaN